ChenDudo/DAPLink/source/hic_hal/mm32/mm32f3270/DAP_config.h
/// Indicate that UART Communication via USB COM Port is available.
/// This information is returned by the command \ref DAP_Info as part of <b>Capabilities</b>.
#define DAP_UART_USB_COM_PORT   1                   ///< USB COM Port:  1 = available, 0 = not available.

/// Debug Unit is connected to fixed Target Device.
/// The Debug Unit may be part of an evaluation board and always connected to a fixed
/// known device. In this case a Device Vendor, Device Name, Board Vendor and Board Name strings
/// are stored and may be used by the debugger or IDE to configure device parameters.
#define TARGET_FIXED            0                   ///< Target: 1 = known, 0 = unknown;

///@}

extern uint8_t swd_write_word(uint32_t addr, uint32_t val);

__STATIC_INLINE void pin_out_init(GPIO_TypeDef *GPIOx, uint8_t pin_bit)
{
    if (pin_bit >= 8)
    {
        GPIOx->CRH &= ~(0x0000000F << ((pin_bit - 8) << 2));
        GPIOx->CRH |= (((uint32_t)(0x00 | 0x03) & 0x0F) << ((pin_bit - 8) << 2));
    }
    else
    {
        GPIOx->CRL &= ~(0x0000000F << ((pin_bit) << 2));
        GPIOx->CRL |= (((uint32_t)(0x00 | 0x03) & 0x0F) << ((pin_bit) << 2));
    }
}

__STATIC_INLINE void pin_out_od_init(GPIO_TypeDef *GPIOx, uint8_t pin_bit)
{
    if (pin_bit >= 8)
    {
        GPIOx->CRH &= ~(0x0000000F << ((pin_bit - 8) << 2));
        GPIOx->CRH |= (((uint32_t)(0x04 | 0x01) & 0x0F) << ((pin_bit - 8) << 2));
    }
    else
    {
        GPIOx->CRL &= ~(0x0000000F << ((pin_bit) << 2));
        GPIOx->CRL |= (((uint32_t)(0x04 | 0x01) & 0x0F) << ((pin_bit) << 2));
    }
}

__STATIC_INLINE void pin_in_init(GPIO_TypeDef *GPIOx, uint8_t pin_bit, uint8_t mode)
{
    uint8_t config;
    if (mode == 1)
        config = 0x08; // Up
    else if (mode == 2)
        config = 0x08; // down
	else if (mode == 3)
        config = 0x01; // floating
    else
        config = 0x00; // GPIO_Mode_AIN

    if (pin_bit >= 8)
    {
        GPIOx->CRH &= ~(0x0000000F << ((pin_bit - 8) << 2));
        GPIOx->CRH |= (((uint32_t)(config)&0x0F) << ((pin_bit - 8) << 2));
        if (mode == 1)
            GPIOx->BSRR = (((uint32_t)0x01) << pin_bit);
        else if (mode == 2)
            GPIOx->BRR = (((uint32_t)0x01) << pin_bit);
    }
    else
    {
        GPIOx->CRL &= ~(0x0000000F << ((pin_bit) << 2));
        GPIOx->CRL |= (((uint32_t)(config)&0x0F) << ((pin_bit) << 2));
        if (mode == 1)
            GPIOx->BSRR = (((uint32_t)0x01) << pin_bit);
        else if (mode == 2)
            GPIOx->BRR = (((uint32_t)0x01) << pin_bit);
    }
}

//**************************************************************************************************
/**
\defgroup DAP_Config_PortIO_gr CMSIS-DAP Hardware I/O Pin Access
\ingroup DAP_ConfigIO_gr
@{

Standard I/O Pins of the CMSIS-DAP Hardware Debug Port support standard JTAG mode
and Serial Wire Debug (SWD) mode. In SWD mode only 2 pins are required to implement the debug
interface of a device. The following I/O Pins are provided:

JTAG I/O Pin                 | SWD I/O Pin          | CMSIS-DAP Hardware pin mode
---------------------------- | -------------------- | ---------------------------------------------
TCK: Test Clock              | SWCLK: Clock         | Output Push/Pull
TMS: Test Mode Select        | SWDIO: Data I/O      | Output Push/Pull; Input (for receiving data)
TDI: Test Data Input         |                      | Output Push/Pull
TDO: Test Data Output        |                      | Input
nTRST: Test Reset (optional) |                      | Output Open Drain with pull-up resistor
nRESET: Device Reset         | nRESET: Device Reset | Output Open Drain with pull-up resistor


DAP Hardware I/O Pin Access Functions
-------------------------------------
The various I/O Pins are accessed by functions that implement the Read, Write, Set, or Clear to
these I/O Pins.

For the SWDIO I/O Pin there are additional functions that are called in SWD I/O mode only.
This functions are provided to achieve faster I/O that is possible with some advanced GPIO
peripherals that can independently write/read a single I/O pin without affecting any other pins
of the same I/O port. The following SWDIO I/O Pin functions are provided:
 - \ref PIN_SWDIO_OUT_ENABLE to enable the output mode from the DAP hardware.
 - \ref PIN_SWDIO_OUT_DISABLE to enable the input mode to the DAP hardware.
 - \ref PIN_SWDIO_IN to read from the SWDIO I/O pin with utmost possible speed.
 - \ref PIN_SWDIO_OUT to write to the SWDIO I/O pin with utmost possible speed.
*/

// Configure DAP I/O pins ------------------------------

/** Setup JTAG I/O pins: TCK, TMS, TDI, TDO, nTRST, and nRESET.
Configures the DAP Hardware I/O pins for JTAG mode:
 - TCK, TMS, TDI, nTRST, nRESET to output mode and set to high level.
 - TDO to input mode.
*/
__STATIC_INLINE void PORT_JTAG_SETUP(void)
{
#if (DAP_JTAG != 0)
    // Set TCK, TMS, TDI GPIO outputs.
    // Set TCK LOW
    SWCLK_TCK_PIN_PORT->BRR = SWCLK_TCK_PIN;
	pin_out_init(SWCLK_TCK_PIN_PORT, SWCLK_TCK_PIN_Bit);
    
    // Set TMS HIGH
    SWDIO_OUT_PIN_PORT->BSRR = SWDIO_OUT_PIN;
    pin_out_init(SWDIO_OUT_PIN_PORT, SWDIO_OUT_PIN_Bit);

    // Set TDI High
#if defined(TDI_PIN_PORT)	
    TDI_PIN_PORT->BSRR = TDI_PIN;
	pin_out_init(TDI_PIN_PORT, TDI_PIN_Bit);
#endif

    // Switch TDO_SWO to GPIO input (TDO).
    pin_in_init(SWDO_PIN_PORT, SWDO_PIN_Bit, 1);
#endif
}

/** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
 - SWCLK, SWDIO, nRESET to output mode and set to default high level.
 - TDI, TMS, nTRST to HighZ mode (pins are unused in SWD mode).
*/
__STATIC_INLINE void PORT_SWD_SETUP(void)
{
    // Set SWCLK LOW
    SWCLK_TCK_PIN_PORT->BRR = SWCLK_TCK_PIN;
	pin_out_init(SWCLK_TCK_PIN_PORT, SWCLK_TCK_PIN_Bit);
    
    // Set SWDIO HIGH
    SWDIO_OUT_PIN_PORT->BSRR = SWDIO_OUT_PIN;
    pin_out_init(SWDIO_OUT_PIN_PORT, SWDIO_OUT_PIN_Bit);
    
    pin_in_init(SWDIO_IN_PIN_PORT, SWDIO_IN_PIN_Bit, 1);

    // Set RESET HIGH
    pin_out_init(nRESET_PIN_PORT, nRESET_PIN_Bit);
	nRESET_PIN_PORT->BSRR = nRESET_PIN;

    // Switch TDO_SWO to GPIO input (SWO).
    pin_in_init(SWDO_PIN_PORT, SWDO_PIN_Bit, 1);
}

